[
  {
    "id": 1,
    "title": "Payment Portal For Dawn Foods",
    "description": "During my co-op at Dawn Foods, I primarily worked with my product design team on creating Figma pages for a new payment portal for customers to be able to make payments through Dawn's own website, instead of using a third-party website.",
    "image": "/images/donuts10.jpg",
    "url": "https://www.figma.com/design/npoEFy3z9KLctbZFd4R023/Payment-Portal?node-id=0-1&t=aUrbD9bbBWDcoc2l-0",
    "category": "UI/UX",
    "company": "Dawn Foods",
    "slug": "payment-portal",
    "images": [
      {
        "src": "/images/pp1.png",
        "caption": "Add New Bank Account Error Messages"
      },
      {
        "src": "/images/p5.png",
        "caption": "System Delay Error on Invoice Tab"
      },
      {
        "src": "/images/p3.png",
        "caption": "Payment History in French"
      }
    ],
    "banner": "/images/donuts10.jpg",
    "content": "<h2>About the project</h2><p> This project focused on creating Dawn Foods' own payment portal, my main project during my co-op there. </p><ol role='list'><li>Developed the French pages for Dawn Foods' custom payment portal, eliminating reliance on a third-party website.</li><li>Collaborated with my team to discuss features such as ACH vs. EFT, error messages, credit card information, and user-friendly design.</li><li>Designed the project in Figma, ensuring the portal was accessible and intuitive for French-speaking users.</li><li>Regularly met with the UX designer to review and refine my work, ensuring alignment with user experience principles.</li></ol><figure style='max-width:1232px'><div><img src='/images/pp7.png' loading='lazy'></div></figure><hr/><h2>Project results</h2><p>At the end of my co-op, the payment portal had significantly improved and we had completely the Figma pages for many aspects of the project.</p><ul role='list'><li>Created a fully functional payment portal with both English and French Figma pages.</li><li>Enabled users to view payment history, add bank accounts and credit cards, access error pages, and view invoices.</li><li>Significantly enhanced user experience and transaction efficiency.<li>I learned how to work more effectively in Figma, such as using local components to ensure the consistency in the designs and reduce repititions.</li></ul>"
  },
  {
    "id": 4,
    "title": "Header Improvement For Dawn Foods",
    "description": "Another project I worked on at Dawn Foods, is creating a new sticky header for the company's website when a customer is on a product listing page.",
    "image": "/images/donut4.jpg",
    "url": "https://www.figma.com/design/2NlTm7SGilwSlQICByeSGQ/Filter-Feature-Improvement?node-id=2-3058&t=bKcOfr9v3fzSpWtu-0",
    "category": "UI/UX",
    "company": "Dawn Foods",
    "slug": "header-improvement",
    "images": [
      {
        "src": "/images/h2.png",
        "caption": "Inital Product Listing Page on Mobile without a header"
      },
      {
        "src": "/images/h1.png",
        "caption": "Implementation of the sticky header on the Product Listing Page"
      }
    ],
    "banner": "/images/donut4.jpg",
    "content": "<h2>About the project</h2><p>The idea of the sticky header is for customers to be able to jump to different sections of the product listing page on their mobile instead of having to scroll without knowing the different sections.</p><ol role='list'><li>Conducted research on other shopping websites such as Amazon and Pinterest to explore the idea of a sticky header on a product listing page.</li><li>Started drafting ideas on Figma based on our current product listing page.</li><li>Created a header that scrolls from left to right to be able to access the different sections.</li><li>The different titles on the header allows the customer to jump to different sections without having to scroll, with the selected section underlined in red.</li></ol><figure style='max-width:1232px'><div><img src='/images/header1.png' loading='lazy'></div></figure><hr/><h2>Project results</h2><p>The addition of the sticky header was approved by the Product Design team after iterating back and forth between designs and ideas.</p><ul role='list'><li> The addition of the sticky header allows the user to access the different information of a product on their phone without having to scroll too long.</li><li>This feature also gives a preview of what is on the product page instead of having to keep looking on their mobile.</li><li>The sticky header improved the experience of our customers who are usually bakery owners who mostly use their mobiles and are looking for a faster checkout process.</li></ul>"
  },
  {
    "id": 5,
    "title": "Filter Improvement For Dawn Foods",
    "description": "Dawn Foods is a wholesale manufacturer and distributor of baked goods, mixes and other foods products. Our customers are primarily bakery owners, sales representatives and supermarket owners. As part of my co-op, I suggested to my team improvements on the current official website. One of these suggestions included improving the filter products page.",
    "image": "/images/donuts.jpg",
    "url": "https://www.figma.com/design/2NlTm7SGilwSlQICByeSGQ/Filter-Feature-Improvement?node-id=25-2861&t=bKcOfr9v3fzSpWtu-0",
    "category": "UI/UX",
    "company": "Dawn Foods",
    "slug": "filter-improvement",
    "banner": "/images/donuts.jpg",
    "images": [
      {
        "src": "/images/before.png",
        "caption": "Initial filter options on the website (Mobile and Desktop)."
      },
      {
        "src": "/images/after2.png",
        "caption": "Enhanced filter interface on mobile for better user experience."
      },
      {
        "src": "/images/filter3.png",
        "caption": "Dekstop view of the improved filter system."
      }
    ],
    "content": "<h2>About the project</h2><p>This project focused on suggesting and implementing improvements to the official Dawn Foods website, particularly enhancing the filter feature for both mobile and desktop platforms.</p><ol role='list'><li>Reviewed the website, took notes on potential improvements, and identified issues with the filter feature.</li><li>The initial filter feature didn't have a clear button to submit the filters, and it also wasn't user-friendly when expanding and collapsing sections. This made it hard for the customer to see what the filter options are and would require extensive scrolling on the mobile screen.</li><li>To tackle this issue, I made figma prototypes to ensure that customers could see all filter options on mobile by making the feature title sticky, preventing excessive scrolling.</li><li>Designed the filter system so that when one feature is open, another one closes, optimizing screen space usage.</li><li>Implemented a button on mobile screens that displays 'apply (1) filters' with the specific number of applied filters, helping customers keep track of their selections.</li></ol><figure style='max-width:1232px'><div><img src='/images/filter3.png'loading='lazy'></div></figure><hr/><h2>Project results</h2><p>After discussing with my product design team, and iterating over my figma suggestions, I was able to finalize the filter feature to be implemented on the official website.<li>Improved mobile user experience by making the filter options more accessible and user-friendly.</li><li>Enhanced customer satisfaction by simplifying the filter process and providing clear feedback on applied filters.</li><li>Optimized screen space usage with efficient feature toggling and sticky titles.</li><li>Contributed to a more streamlined and intuitive mobile browsing experience.</li></ul>"
  },
  {
    "id": 6,
    "title": "Tubender Website",
    "description": "As part of Generate, a student-led organization at Northeastern, we collaborated with a startup that builds portable tube-bending machines to design their software and branding. Both the application and branding website was coded from scratch through react and typescript.",
    "image": "/images/Tubender.png",
    "url": "https://github.com/GenerateNU/Tubender",
    "category": "Software",
    "company": "Generate",
    "slug": "tubender",
    "banner": "/images/Tubender.png",
    "images": [
      {
        "src": "/images/tubender1.png",
        "caption": "Welcome page of the app"
      },
      {
        "src": "/images/tubender4.png",
        "caption": "Page that allows the users to add and customize bends"
      },
      {
        "src": "/images/tubender3.png",
        "caption": "Collaborative design process with the backend team to download file or upload to machine."
      },
      {
        "src": "/images/tubender2.png",
        "caption": "Branding Website Page through React"
      }
    ],
    "content": "<h2>About the project</h2><p> In collaboration with the startup Tubender, I was part of the software engineering team of 12 members. My role in the project was to code both the official website for Tubender as well as work on the front end software when a customer is designing a tube. </p><ol role='list'><li>To design both the website and the tube making software, I initiated a react project using typescript.</li><li>The process consisted of making my coding as efficient as possible and collaborating with the backend engineers to be able to connect the C++ components.</li><li>Some features that I learned to code include designing side bars to switch between the tube bends and add new bends.</li><li>I also designed the front end for error messages such as restricting the tube length and materials.</li></ol><figure style='max-width:1232px'><div><img src='/images/tubender2.png' loading='lazy'></div></figure><hr/><h2>Project results</h2><p> <li>Our team delivered the official website for Tubender from start to finish, including creating designs in Figma and coding the website in react.</li><li>Developed software that allows customers to upload a CAD file or create a custom bend.</li><li>Enabled users to design a tube directly on the platform.</li></ul>"
  },
  {
    "id": 7,
    "title": "BMC Research",
    "description": "Developed a website with a research team for ENT oncology using Typescript and React, integrating a recommender system for personalized treatment recommendations.",
    "image": "/images/bmc2.gif",
    "url": "#",
    "category": "Software",
    "company": "Boston Medical Center",
    "slug": "bmc-research",
    "banner": "/images/bmc2.jpg",
    "images": [
      {
        "src": "/images/bmc.png",
        "caption": "Homepage of the ENT oncology research website."
      },
      {
        "src": "/images/bmc2.png",
        "caption": "Interface displaying the form that must be completed to predict treatment recommendations."
      },
      {
        "src": "/images/bmc3.png",
        "caption": "Detailed view of the AI model integration."
      },
      {
        "src": "/images/bmc4.png",
        "caption": "Analysis page showing patient-specific data predictions."
      }
    ],
    "content": "<h2>About the project</h2><p></p><ol role='list'><li>Partnered with a research team and professor to create a website for ENT oncology using React and TypeScript. Integrated a recommender system for personalized treatment recommendations.</li><li>Designed a user-friendly interface that utilized TypeScript for type safety and React for dynamic rendering. This interface facilitated the analysis of patient-specific data to enhance personalized care.</li><li>Deployed the website on Microsoft Azure, ensuring scalability and reliability. Managed the deployment process and set up the necessary infrastructure.</li><li>Worked closely with a backend developer who created the AI model, connecting it to the front end. This collaboration ensured seamless integration and functionality. Played a key role in both the design and coding aspects, writing clean, maintainable code, and creating intuitive user interfaces.</li></ol><figure style='max-width:1232px'><div><img src='/images/bmc2.png' loading='lazy'></div></figure><hr/><h2>Project results</h2><p></li><li>The website is used by the research team to predict cancer percentages, leveraging the integrated AI model for accurate and reliable predictions.</li><li>The system suggests tailored treatment methods based on the analyzed patient-specific data, enhancing the quality of care for oncology patients.</li><li>This project culminated in a published research paper, highlighting its significance and contribution to the field of ENT oncology.</li></ul>"
  },
  {
    "id": 8,
    "title": "Personal Website",
    "description": "This project is this current website that showcases my work as both a UX Designer and Software Engineer.",
    "image": "/images/portfolio.png",
    "url": "https://github.com/nourtawfik04/vite-react-portfolio-1",
    "category": "Software",
    "company": "Personal",
    "slug": "personal-website",
    "banner": "/images/w1.png",
    "images": [
      {
        "src": "/images/w1.png",
        "caption": "Portfolio Main Page Design"
      },
      {
        "src": "/images/w2.png",
        "caption": "Website Header For Navigation"
      },
      {
        "src": "/images/w3.png",
        "caption": "About Me Page"
      }
    ],
    "content": "<h2>About the project</h2><p></p><ol role='list'><li>Designed portfolio files in Figma and developed the website from scratch using React, TypeScript, and JSON, ensuring a robust and dynamic user experience.</li><li>Employed efficient coding methods by using a consistent template for each project, with JSON files to easily update content such as paragraphs and images, streamlining the development process.</li><li>Highlighted all UX and coding projects on the website, showcasing front-end development and UX design skills, demonstrating versatility and expertise in both areas.</li><li>Followed a structured process by first designing in Figma, then translating those designs into React code, and finally deploying the project on Microsoft Azure for optimal performance and accessibility.</li></ol><figure style='max-width:1232px'><div><img src='/images/portfolio.png' loading='lazy'></div></figure><hr/><h2>Project results</h2><li>The website is now being used as a portfolio to display my projects, effectively highlighting both my design and coding skills to potential employers and collaborators.</li><li>The website includes my resume, providing a comprehensive view of my professional background and achievements in a single, easily accessible location.</li><li>By showcasing both my UX design and front-end development skills, the website serves as a powerful tool to demonstrate my versatility and expertise in creating dynamic and user-friendly web applications.</li></ul>"
  }
]
